beaker/results/mysql-a.txt
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb?serverTimezone=UTC
Using shards: 1, batchSize:1000, fetchSize: 10
[OVERALL], RunTime(ms), 1154
[OVERALL], Throughput(ops/sec), 866.5511265164645
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 497
[READ], AverageLatency(us), 544.4346076458753
[READ], MinLatency(us), 246
[READ], MaxLatency(us), 4025
[READ], 95thPercentileLatency(us), 960
[READ], 99thPercentileLatency(us), 2473
[READ], Return=OK, 497
[READ], 246, 1.0
[READ], 249, 1.0
[READ], 251, 1.0
[READ], 253, 2.0
[READ], 259, 2.0
[READ], 263, 2.0
[READ], 266, 1.0
[READ], 267, 1.0
[READ], 269, 1.0
[READ], 272, 1.0
[READ], 273, 1.0
[READ], 275, 1.0
[READ], 276, 1.0
[READ], 284, 1.0
[READ], 285, 1.0
[READ], 287, 1.0
[READ], 288, 1.0
[READ], 291, 1.0
[READ], 292, 1.0
[READ], 293, 3.0
[READ], 297, 1.0
[READ], 298, 2.0
[READ], 299, 1.0
[READ], 300, 1.0
[READ], 302, 2.0
[READ], 303, 2.0
[READ], 305, 2.0
[READ], 306, 2.0
[READ], 307, 2.0
[READ], 308, 1.0
[READ], 309, 1.0
[READ], 310, 2.0
[READ], 311, 1.0
[READ], 312, 2.0
[READ], 314, 1.0
[READ], 315, 3.0
[READ], 316, 2.0
[READ], 317, 2.0
[READ], 319, 3.0
[READ], 322, 1.0
[READ], 323, 1.0
[READ], 324, 2.0
[READ], 325, 1.0
[READ], 326, 2.0
[READ], 327, 1.0
[READ], 328, 2.0
[READ], 329, 2.0
[READ], 331, 1.0
[READ], 333, 2.0
[READ], 334, 2.0
[READ], 335, 2.0
[READ], 336, 2.0
[READ], 337, 1.0
[READ], 339, 1.0
[READ], 340, 1.0
[READ], 341, 2.0
[READ], 342, 2.0
[READ], 344, 1.0
[READ], 345, 3.0
[READ], 346, 1.0
[READ], 348, 1.0
[READ], 349, 2.0
[READ], 350, 1.0
[READ], 353, 5.0
[READ], 354, 1.0
[READ], 355, 1.0
[READ], 356, 1.0
[READ], 358, 2.0
[READ], 361, 3.0
[READ], 362, 1.0
[READ], 363, 2.0
[READ], 364, 1.0
[READ], 365, 1.0
[READ], 366, 4.0
[READ], 367, 2.0
[READ], 368, 2.0
[READ], 369, 4.0
[READ], 370, 2.0
[READ], 371, 2.0
[READ], 372, 1.0
[READ], 373, 2.0
[READ], 375, 1.0
[READ], 376, 1.0
[READ], 377, 3.0
[READ], 378, 3.0
[READ], 380, 1.0
[READ], 382, 2.0
[READ], 384, 1.0
[READ], 386, 2.0
[READ], 388, 3.0
[READ], 389, 3.0
[READ], 390, 1.0
[READ], 391, 1.0
[READ], 392, 1.0
[READ], 393, 4.0
[READ], 394, 4.0
[READ], 395, 2.0
[READ], 396, 1.0
[READ], 397, 2.0
[READ], 398, 4.0
[READ], 400, 1.0
[READ], 401, 2.0
[READ], 402, 1.0
[READ], 403, 2.0
[READ], 404, 1.0
[READ], 406, 2.0
[READ], 407, 2.0
[READ], 408, 2.0
[READ], 409, 1.0
[READ], 410, 1.0
[READ], 412, 4.0
[READ], 413, 1.0
[READ], 414, 3.0
[READ], 415, 2.0
[READ], 417, 1.0
[READ], 418, 2.0
[READ], 419, 2.0
[READ], 420, 1.0
[READ], 422, 1.0
[READ], 423, 1.0
[READ], 424, 1.0
[READ], 425, 2.0
[READ], 426, 2.0
[READ], 427, 2.0
[READ], 429, 3.0
[READ], 430, 2.0
[READ], 432, 5.0
[READ], 433, 1.0
[READ], 435, 2.0
[READ], 436, 3.0
[READ], 437, 2.0
[READ], 438, 2.0
[READ], 439, 2.0
[READ], 440, 2.0
[READ], 442, 1.0
[READ], 443, 1.0
[READ], 444, 4.0
[READ], 446, 2.0
[READ], 447, 5.0
[READ], 448, 1.0
[READ], 450, 3.0
[READ], 452, 1.0
[READ], 453, 2.0
[READ], 456, 4.0
[READ], 457, 1.0
[READ], 458, 3.0
[READ], 459, 4.0
[READ], 461, 3.0
[READ], 462, 2.0
[READ], 463, 1.0
[READ], 464, 1.0
[READ], 467, 1.0
[READ], 469, 1.0
[READ], 470, 1.0
[READ], 471, 1.0
[READ], 472, 1.0
[READ], 473, 2.0
[READ], 474, 1.0
[READ], 475, 1.0
[READ], 476, 2.0
[READ], 478, 2.0
[READ], 479, 4.0
[READ], 480, 2.0
[READ], 481, 1.0
[READ], 484, 1.0
[READ], 485, 2.0
[READ], 486, 1.0
[READ], 487, 1.0
[READ], 489, 3.0
[READ], 490, 1.0
[READ], 491, 1.0
[READ], 493, 1.0
[READ], 494, 1.0
[READ], 495, 1.0
[READ], 496, 4.0
[READ], 498, 3.0
[READ], 501, 2.0
[READ], 502, 1.0
[READ], 505, 2.0
[READ], 506, 1.0
[READ], 507, 1.0
[READ], 509, 2.0
[READ], 511, 1.0
[READ], 512, 1.0
[READ], 513, 1.0
[READ], 514, 2.0
[READ], 516, 2.0
[READ], 517, 2.0
[READ], 518, 1.0
[READ], 520, 1.0
[READ], 521, 3.0
[READ], 523, 1.0
[READ], 532, 1.0
[READ], 534, 1.0
[READ], 535, 2.0
[READ], 536, 2.0
[READ], 540, 1.0
[READ], 542, 1.0
[READ], 543, 1.0
[READ], 545, 1.0
[READ], 547, 1.0
[READ], 553, 1.0
[READ], 555, 2.0
[READ], 556, 1.0
[READ], 558, 1.0
[READ], 559, 1.0
[READ], 560, 1.0
[READ], 562, 1.0
[READ], 565, 2.0
[READ], 567, 1.0
[READ], 568, 1.0
[READ], 576, 1.0
[READ], 577, 1.0
[READ], 583, 2.0
[READ], 584, 1.0
[READ], 587, 1.0
[READ], 588, 2.0
[READ], 590, 1.0
[READ], 592, 3.0
[READ], 596, 1.0
[READ], 597, 1.0
[READ], 602, 2.0
[READ], 605, 1.0
[READ], 606, 2.0
[READ], 609, 1.0
[READ], 610, 1.0
[READ], 612, 1.0
[READ], 613, 1.0
[READ], 614, 2.0
[READ], 616, 1.0
[READ], 617, 1.0
[READ], 623, 1.0
[READ], 624, 2.0
[READ], 625, 2.0
[READ], 627, 1.0
[READ], 635, 1.0
[READ], 637, 2.0
[READ], 640, 2.0
[READ], 641, 1.0
[READ], 643, 2.0
[READ], 645, 2.0
[READ], 647, 1.0
[READ], 648, 1.0
[READ], 653, 1.0
[READ], 656, 1.0
[READ], 663, 1.0
[READ], 667, 1.0
[READ], 668, 1.0
[READ], 671, 2.0
[READ], 674, 1.0
[READ], 682, 1.0
[READ], 683, 1.0
[READ], 687, 1.0
[READ], 688, 1.0
[READ], 689, 1.0
[READ], 691, 1.0
[READ], 692, 2.0
[READ], 693, 1.0
[READ], 699, 1.0
[READ], 702, 1.0
[READ], 705, 1.0
[READ], 708, 3.0
[READ], 709, 1.0
[READ], 710, 1.0
[READ], 711, 1.0
[READ], 717, 1.0
[READ], 719, 1.0
[READ], 720, 1.0
[READ], 721, 1.0
[READ], 722, 1.0
[READ], 724, 2.0
[READ], 725, 2.0
[READ], 727, 1.0
[READ], 729, 1.0
[READ], 735, 1.0
[READ], 737, 1.0
[READ], 739, 1.0
[READ], 746, 1.0
[READ], 747, 2.0
[READ], 749, 1.0
[READ], 771, 1.0
[READ], 773, 1.0
[READ], 776, 1.0
[READ], 789, 1.0
[READ], 795, 1.0
[READ], 798, 1.0
[READ], 823, 1.0
[READ], 835, 1.0
[READ], 836, 1.0
[READ], 845, 1.0
[READ], 866, 1.0
[READ], 868, 1.0
[READ], 870, 1.0
[READ], 893, 1.0
[READ], 904, 1.0
[READ], 921, 1.0
[READ], 924, 1.0
[READ], 930, 1.0
[READ], 957, 1.0
[READ], 959, 1.0
[READ], 960, 1.0
[READ], 992, 2.0
[READ], 1036, 1.0
[READ], 1081, 1.0
[READ], 1169, 1.0
[READ], 1198, 1.0
[READ], 1247, 1.0
[READ], 1356, 1.0
[READ], 1414, 1.0
[READ], 1505, 1.0
[READ], 1569, 1.0
[READ], 1623, 1.0
[READ], 1634, 1.0
[READ], 1642, 1.0
[READ], 1811, 1.0
[READ], 1902, 1.0
[READ], 2042, 1.0
[READ], 2087, 1.0
[READ], 2357, 1.0
[READ], 2473, 1.0
[READ], 2623, 1.0
[READ], 2813, 1.0
[READ], 2867, 1.0
[READ], 3061, 1.0
[READ], 4025, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 11404.0
[CLEANUP], MinLatency(us), 11400
[CLEANUP], MaxLatency(us), 11407
[CLEANUP], 95thPercentileLatency(us), 11407
[CLEANUP], 99thPercentileLatency(us), 11407
[CLEANUP], 11407, 1.0
[UPDATE], Operations, 503
[UPDATE], AverageLatency(us), 468.06361829025843
[UPDATE], MinLatency(us), 208
[UPDATE], MaxLatency(us), 11063
[UPDATE], 95thPercentileLatency(us), 732
[UPDATE], 99thPercentileLatency(us), 2265
[UPDATE], Return=OK, 503
[UPDATE], 208, 1.0
[UPDATE], 214, 1.0
[UPDATE], 219, 1.0
[UPDATE], 227, 1.0
[UPDATE], 229, 2.0
[UPDATE], 232, 1.0
[UPDATE], 233, 1.0
[UPDATE], 234, 1.0
[UPDATE], 240, 2.0
[UPDATE], 241, 3.0
[UPDATE], 243, 1.0
[UPDATE], 244, 1.0
[UPDATE], 245, 2.0
[UPDATE], 247, 2.0
[UPDATE], 248, 2.0
[UPDATE], 249, 1.0
[UPDATE], 252, 2.0
[UPDATE], 253, 2.0
[UPDATE], 255, 3.0
[UPDATE], 256, 2.0
[UPDATE], 260, 2.0
[UPDATE], 261, 1.0
[UPDATE], 262, 2.0
[UPDATE], 264, 2.0
[UPDATE], 265, 2.0
[UPDATE], 266, 1.0
[UPDATE], 267, 2.0
[UPDATE], 268, 2.0
[UPDATE], 269, 2.0
[UPDATE], 270, 1.0
[UPDATE], 271, 1.0
[UPDATE], 272, 3.0
[UPDATE], 273, 2.0
[UPDATE], 276, 3.0
[UPDATE], 279, 2.0
[UPDATE], 280, 1.0
[UPDATE], 281, 1.0
[UPDATE], 282, 3.0
[UPDATE], 283, 1.0
[UPDATE], 284, 1.0
[UPDATE], 285, 2.0
[UPDATE], 286, 1.0
[UPDATE], 287, 1.0
[UPDATE], 288, 3.0
[UPDATE], 289, 1.0
[UPDATE], 290, 2.0
[UPDATE], 291, 2.0
[UPDATE], 293, 3.0
[UPDATE], 294, 5.0
[UPDATE], 295, 3.0
[UPDATE], 297, 2.0
[UPDATE], 298, 3.0
[UPDATE], 299, 1.0
[UPDATE], 300, 2.0
[UPDATE], 302, 1.0
[UPDATE], 303, 5.0
[UPDATE], 304, 1.0
[UPDATE], 306, 5.0
[UPDATE], 307, 2.0
[UPDATE], 308, 1.0
[UPDATE], 309, 1.0
[UPDATE], 310, 1.0
[UPDATE], 311, 2.0
[UPDATE], 312, 4.0
[UPDATE], 314, 3.0
[UPDATE], 315, 2.0
[UPDATE], 316, 1.0
[UPDATE], 317, 3.0
[UPDATE], 318, 1.0
[UPDATE], 319, 3.0
[UPDATE], 320, 1.0
[UPDATE], 321, 3.0
[UPDATE], 322, 3.0
[UPDATE], 323, 2.0
[UPDATE], 325, 1.0
[UPDATE], 326, 1.0
[UPDATE], 327, 5.0
[UPDATE], 328, 3.0
[UPDATE], 329, 3.0
[UPDATE], 330, 2.0
[UPDATE], 331, 9.0
[UPDATE], 332, 5.0
[UPDATE], 333, 2.0
[UPDATE], 334, 1.0
[UPDATE], 335, 2.0
[UPDATE], 337, 1.0
[UPDATE], 338, 4.0
[UPDATE], 339, 6.0
[UPDATE], 340, 1.0
[UPDATE], 341, 1.0
[UPDATE], 342, 1.0
[UPDATE], 343, 1.0
[UPDATE], 344, 1.0
[UPDATE], 346, 2.0
[UPDATE], 347, 2.0
[UPDATE], 348, 1.0
[UPDATE], 349, 1.0
[UPDATE], 351, 2.0
[UPDATE], 353, 3.0
[UPDATE], 355, 1.0
[UPDATE], 357, 1.0
[UPDATE], 358, 2.0
[UPDATE], 359, 1.0
[UPDATE], 360, 2.0
[UPDATE], 361, 4.0
[UPDATE], 362, 3.0
[UPDATE], 363, 1.0
[UPDATE], 364, 1.0
[UPDATE], 366, 2.0
[UPDATE], 367, 1.0
[UPDATE], 368, 3.0
[UPDATE], 369, 1.0
[UPDATE], 370, 1.0
[UPDATE], 371, 2.0
[UPDATE], 372, 1.0
[UPDATE], 373, 2.0
[UPDATE], 374, 2.0
[UPDATE], 375, 5.0
[UPDATE], 376, 2.0
[UPDATE], 377, 1.0
[UPDATE], 378, 3.0
[UPDATE], 379, 2.0
[UPDATE], 380, 4.0
[UPDATE], 382, 2.0
[UPDATE], 383, 4.0
[UPDATE], 384, 3.0
[UPDATE], 385, 1.0
[UPDATE], 389, 3.0
[UPDATE], 390, 3.0
[UPDATE], 391, 1.0
[UPDATE], 392, 1.0
[UPDATE], 393, 1.0
[UPDATE], 394, 1.0
[UPDATE], 395, 4.0
[UPDATE], 396, 5.0
[UPDATE], 397, 1.0
[UPDATE], 398, 4.0
[UPDATE], 399, 2.0
[UPDATE], 400, 1.0
[UPDATE], 401, 1.0
[UPDATE], 402, 1.0
[UPDATE], 403, 2.0
[UPDATE], 405, 1.0
[UPDATE], 406, 2.0
[UPDATE], 407, 2.0
[UPDATE], 408, 2.0
[UPDATE], 409, 3.0
[UPDATE], 410, 1.0
[UPDATE], 411, 1.0
[UPDATE], 412, 2.0
[UPDATE], 413, 2.0
[UPDATE], 417, 2.0
[UPDATE], 418, 2.0
[UPDATE], 419, 1.0
[UPDATE], 420, 1.0
[UPDATE], 422, 3.0
[UPDATE], 423, 1.0
[UPDATE], 424, 3.0
[UPDATE], 425, 2.0
[UPDATE], 427, 2.0
[UPDATE], 429, 1.0
[UPDATE], 430, 1.0
[UPDATE], 431, 2.0
[UPDATE], 432, 1.0
[UPDATE], 433, 1.0
[UPDATE], 434, 2.0
[UPDATE], 436, 1.0
[UPDATE], 437, 2.0
[UPDATE], 438, 1.0
[UPDATE], 439, 1.0
[UPDATE], 441, 1.0
[UPDATE], 443, 2.0
[UPDATE], 446, 4.0
[UPDATE], 448, 3.0
[UPDATE], 450, 1.0
[UPDATE], 451, 1.0
[UPDATE], 452, 2.0
[UPDATE], 453, 1.0
[UPDATE], 454, 1.0
[UPDATE], 455, 1.0
[UPDATE], 456, 1.0
[UPDATE], 457, 1.0
[UPDATE], 458, 2.0
[UPDATE], 459, 1.0
[UPDATE], 460, 2.0
[UPDATE], 463, 1.0
[UPDATE], 464, 2.0
[UPDATE], 465, 2.0
[UPDATE], 469, 1.0
[UPDATE], 470, 1.0
[UPDATE], 472, 2.0
[UPDATE], 473, 1.0
[UPDATE], 475, 2.0
[UPDATE], 476, 3.0
[UPDATE], 477, 1.0
[UPDATE], 478, 2.0
[UPDATE], 479, 1.0
[UPDATE], 482, 1.0
[UPDATE], 483, 1.0
[UPDATE], 484, 1.0
[UPDATE], 489, 1.0
[UPDATE], 490, 2.0
[UPDATE], 491, 1.0
[UPDATE], 492, 2.0
[UPDATE], 496, 3.0
[UPDATE], 497, 2.0
[UPDATE], 499, 1.0
[UPDATE], 500, 2.0
[UPDATE], 501, 2.0
[UPDATE], 503, 3.0
[UPDATE], 504, 1.0
[UPDATE], 505, 1.0
[UPDATE], 506, 1.0
[UPDATE], 507, 1.0
[UPDATE], 511, 1.0
[UPDATE], 513, 1.0
[UPDATE], 514, 2.0
[UPDATE], 515, 1.0
[UPDATE], 517, 1.0
[UPDATE], 525, 1.0
[UPDATE], 528, 1.0
[UPDATE], 530, 1.0
[UPDATE], 534, 1.0
[UPDATE], 536, 1.0
[UPDATE], 538, 1.0
[UPDATE], 544, 1.0
[UPDATE], 547, 1.0
[UPDATE], 548, 1.0
[UPDATE], 549, 1.0
[UPDATE], 552, 1.0
[UPDATE], 558, 1.0
[UPDATE], 561, 2.0
[UPDATE], 562, 2.0
[UPDATE], 566, 2.0
[UPDATE], 569, 1.0
[UPDATE], 571, 2.0
[UPDATE], 572, 1.0
[UPDATE], 573, 1.0
[UPDATE], 574, 2.0
[UPDATE], 578, 1.0
[UPDATE], 584, 2.0
[UPDATE], 589, 2.0
[UPDATE], 591, 1.0
[UPDATE], 593, 1.0
[UPDATE], 598, 1.0
[UPDATE], 600, 1.0
[UPDATE], 602, 1.0
[UPDATE], 616, 1.0
[UPDATE], 618, 1.0
[UPDATE], 621, 1.0
[UPDATE], 622, 1.0
[UPDATE], 629, 1.0
[UPDATE], 632, 1.0
[UPDATE], 634, 1.0
[UPDATE], 643, 1.0
[UPDATE], 647, 1.0
[UPDATE], 651, 1.0
[UPDATE], 655, 1.0
[UPDATE], 658, 2.0
[UPDATE], 662, 1.0
[UPDATE], 667, 1.0
[UPDATE], 670, 1.0
[UPDATE], 677, 1.0
[UPDATE], 681, 1.0
[UPDATE], 683, 1.0
[UPDATE], 699, 1.0
[UPDATE], 703, 1.0
[UPDATE], 712, 1.0
[UPDATE], 714, 1.0
[UPDATE], 715, 1.0
[UPDATE], 721, 2.0
[UPDATE], 723, 1.0
[UPDATE], 728, 1.0
[UPDATE], 732, 1.0
[UPDATE], 738, 1.0
[UPDATE], 749, 1.0
[UPDATE], 763, 1.0
[UPDATE], 769, 1.0
[UPDATE], 833, 1.0
[UPDATE], 861, 1.0
[UPDATE], 876, 1.0
[UPDATE], 915, 1.0
[UPDATE], 924, 2.0
[UPDATE], 1031, 1.0
[UPDATE], 1169, 1.0
[UPDATE], 1199, 1.0
[UPDATE], 1221, 1.0
[UPDATE], 1328, 1.0
[UPDATE], 1423, 1.0
[UPDATE], 1501, 1.0
[UPDATE], 1645, 1.0
[UPDATE], 2019, 1.0
[UPDATE], 2265, 1.0
[UPDATE], 2353, 1.0
[UPDATE], 2729, 1.0
[UPDATE], 3029, 1.0
[UPDATE], 3983, 1.0
[UPDATE], 11063, 1.0